In [2]:
import pandas as pd
df=pd.read_csv('Titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Creating a new dataframe

In [8]:
# you want crete new data frame with pmdas

import pandas as pd
frame=pd.DataFrame()
# add colums to dataframe
frame['Name']=['sougata','soumya']

frame['Age']=[20,21]

frame['Gender']=['Male','Male']

# show dataframe 

frame

      Name  Age Gender
0  sougata   20   Male
1   soumya   21   Male

## create a new row or add a new row

In [13]:
new_person = {"Name": "Sourav", "Gender": "male", "Age": 30}
# Append row
frame = frame._append(new_person, ignore_index=True)
print(frame)

# ****IMPORTANT NOTE **** append function removed frompanda s libary to use this function _append insted of the append function

      Name  Age Gender
0  sougata   20   Male
1   soumya   21   Male
2   Sourav   30   male
3   Sourav   30   male

# DESCRIBING THE DATA

In [17]:
import pandas as pd
df=pd.read_csv('titan.csv')

# sshow two rows

df.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [18]:
# number of rows and columns
# show dimensions
df.shape

(1313, 6)

In [19]:
# show statistics
df.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

## problem -> you need toselect indivisual data or slice of a data frame

In [20]:
# select first row
df.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [21]:
#select three rows
df.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

## selecting rows based on conditionnal

In [22]:
# problem--> you want to select rows based on some condition .
# show two rows where column sex = female.
df[df['Sex']=='female'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [24]:
# Filter rows
df[(df['Sex']=='female') & ( df['Age'] >= 65)]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

## REPLACING VALUES

### PROBLEM : YOU NEED TO REPLACE VALUES IN THE DATA FRAME

In [25]:
df.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [28]:
# replace sex code 1 == one
df.replace(1,"one").head(2)
#df.head()

                           Name PClass   Age     Sex Survived SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female      one     one
1   Allison, Miss Helen Loraine    1st   2.0  female        0     one